---
type: IEntryPoint
namespace: Autodesk.Revit.DB.Macros
version: 2024
members: 4
tags: [revit-api, class]
---

# IEntryPoint

`Autodesk.Revit.DB.Macros.IEntryPoint` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | FinishInitialization | — | `void FinishInitialization ()` |
| Method | Initialize | — | `void Initialize ( Object obj , string addinFolder )` |
| Method | OnShutdown | — | `void OnShutdown ()` |
| Property | AddinFolder | — | `string AddinFolder { get ; }` |